-----------------------------------------------------------------------------
-- Определить количества заказов в базе данных. --
-----------------------------------------------------------------------------
SELECT COUNT(*)
FROM orders;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Выполнить расчет количества позиций и общую стоимость товаров --
-- входящих в заказ, зарегистрированный под кодом номер 5. --
-----------------------------------------------------------------------------
SELECT COUNT(orderID), SUM(amount * sellingPrice)
FROM ordered_products
WHERE orderID = 5;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Выполнить расчет количества поставленного на склад товара с кодом 4 --
-- менеджером поставщика с кодом 3. ---
-----------------------------------------------------------------------------
SELECT COUNT(si.productID)
FROM stock_info si, arrive_stock a_s
WHERE a_s.supplierID = 3
AND si.stockID = a_s.stockID
AND si.productID = 4;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Выполнить расчет общей стоимости поставленной продукции в --
-- сентябре 2010г. менеджерами поставщика. --
-----------------------------------------------------------------------------
SELECT supplierID, SUM(amount * price) AS 'Cost'
FROM arrive_stock
WHERE arriveDate BETWEEN '2010-09-01' AND '2010-09-30'
GROUP BY supplierID;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Получить количество типов мониторов, имеющихся  в наличии на складе. --
-----------------------------------------------------------------------------
SELECT COUNT(si.productID)
FROM stock_info si, products p
WHERE si.productID = p.productID
AND p.name = 'Monitor';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Выполнить расчет количества заказов, которые обслуживали сотрудники --
-- фирм в 2010г. --
-----------------------------------------------------------------------------
SELECT COUNT(*)
FROM orders
WHERE orderDate LIKE '2010-__-__';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести количество заказов, сделанных всеми менеджерами клиентов, --
-- отсортированными в алфавитном порядке по менеджеру. --
-----------------------------------------------------------------------------
SELECT o.clientManagerID, COUNT(o.orderID)
FROM orders o, clients c
WHERE c.clientManagerID = o.clientManagerID
GROUP BY clientManagerID
ORDER BY c.manager;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести наименования товаров на складах, остатки которых меньше 50. --
-----------------------------------------------------------------------------
SELECT p.name
FROM stock_info si, products p
WHERE p.productID = si.productID
GROUP BY si.productID
HAVING SUM(si.productsLeft) < 50;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести  список менеджеров клиентов, общая сумма заказов которых --
-- составила 1000 и более денежных единиц. --
-----------------------------------------------------------------------------
SELECT c.manager, SUM(o.totalAmount) AS 'total sum'
FROM orders o, clients c
WHERE o.clientManagerID = c.clientManagerID
GROUP BY c.manager
HAVING SUM(o.totalAmount) > 1000;
-----------------------------------------------------------------------------
