-----------------------------------------------------------------------------
-- Построить запрос, формирующий вывод всех данных обо всех организациях. --
-----------------------------------------------------------------------------
SELECT *
FROM organizations;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Построить запрос, формирующий вывод  названия, УНП и фамилии --
-- руководителя всех  организаций, отсортированные в алфавитном порядке --
-- по названию организации. --
-----------------------------------------------------------------------------
SELECT name, taxNumber, boss
FROM organizations
ORDER BY name;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести все данные об организации с названием «JSC Crystal» ---
-----------------------------------------------------------------------------
SELECT *
FROM organizations
WHERE name = 'JSC Crystal';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести все данные об организациях, являющихся ООО (Ltd.) --
-----------------------------------------------------------------------------
SELECT *
FROM organizations
WHERE name LIKE ('%Ltd.%');
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Сформировать список (содержащий спецификацию, отпускную цену, остаток) --
-- товаров на складе по коду каталога 3, остатки которых --
-- более 10 единиц. --
-----------------------------------------------------------------------------
SELECT productPrice, productsLeft, specification
FROM stock_info
WHERE stockID = 3
AND productsLeft > 10;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Получить список, содержащий спецификацию и отпускную стоимость всех --
-- товаров на складе по коду каталога 5 и отсортированный в обратном --
-- порядке по отпускной стоимости. --
-----------------------------------------------------------------------------
SELECT productPrice, specification
FROM stock_info
WHERE stockID = 5
ORDER BY productPrice DESC;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести все заказы, которые оформил сотрудник фирмы по фамилии --
-- "Boyce M. Messer" в октябре 2010г., с указанием кода заказа, --
-- номера накладной, даты заказа и общей суммы. --
-----------------------------------------------------------------------------
SELECT invoiceNumber, orderDate, SUM(totalAmount)
FROM employees, orders
WHERE name = 'Boyce M. Messer'
AND orderDate BETWEEN '2010-11-01' AND '2010-11-31';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести наименование, спецификацию и остатки на складе товаров с --
-- наименованием «Monitor». --
-----------------------------------------------------------------------------
SELECT p.name, si.stockID, si.productsLeft, si.specification
FROM products p, stock_info si
WHERE p.productID = si.productID
AND p.name = 'Monitor';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести (наименование, спецификацию, дату и количество) поставки --
-- на склад мониторов, отсортированные по спецификации и дате --
-- в прямом порядке --
-----------------------------------------------------------------------------
SELECT p.name, si.specification, a_s.amount, a_s.arriveDate
FROM products p, stock_info si, arrive_stock a_s
WHERE p.productID = si.productID
AND p.name = 'Monitor'
AND si.stockID = a_s.stockID
ORDER BY specification, arriveDate;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести (наименование, спецификацию, дату поставки, количество --
-- и организацию) поставки JSC Crystal на склад товара с --
-- наименованием «Soap». --
-----------------------------------------------------------------------------
SELECT p.name, si.specification, a_s.amount, a_s.arriveDate, o.name
FROM products p, stock_info si, arrive_stock a_s, organizations o
WHERE p.productID = si.productID
AND p.name = 'Soap'
AND si.stockID = a_s.stockID
AND o.name = 'JSC Crystal';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести состав заказа с кодом 8. --
-----------------------------------------------------------------------------
SELECT o.orderID, o.invoiceNumber, o.orderDate,
	   o.shipmentDate, o.totalAmount, o.comments,
       c.manager, e.name AS 'employee', s.status
FROM orders o, clients c, employees e, order_status s
WHERE o.orderID = 8
AND o.clientManagerID = c.clientManagerID
AND o.employeeID = e.employeeID
AND o.statusID = s.statusID;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести отсортированный по менеджерам (прямом в порядке) список --
-- менеджеров клиентов и коды заказов, которые они сделали. --
-----------------------------------------------------------------------------
SELECT c.manager, o.orderID
FROM clients c, orders o
WHERE c.clientManagerID = o.clientManagerID
ORDER BY c.manager;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести коды и наименования товаров, которые еще не поставлялись. --
-----------------------------------------------------------------------------
SELECT productID, name
FROM products
WHERE productID NOT IN (SELECT productID
						FROM stock_info);
-----------------------------------------------------------------------------
