-----------------------------------------------------------------------------
-- Построить запрос, формирующий вывод всех данных обо всех организациях. --
-----------------------------------------------------------------------------
SELECT *
FROM organizations;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Построить запрос, формирующий вывод  названия, УНП и фамилии --
-- руководителя всех  организаций, отсортированные в алфавитном порядке --
-- по названию организации. --
-----------------------------------------------------------------------------
SELECT name, taxNumber, boss
FROM organizations
ORDER BY name;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести все данные об организации с названием «JSC Crystal» ---
-----------------------------------------------------------------------------
SELECT *
FROM organizations
WHERE name = 'JSC Crystal';
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Вывести все данные об организациях, являющихся ООО (Ltd.) --
-----------------------------------------------------------------------------
SELECT *
FROM organizations
WHERE name LIKE ('%Ltd.%');
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Сформировать список (содержащий спецификацию, отпускную цену, остаток) --
-- товаров на складе по коду каталога 3, остатки которых --
-- более 10 единиц. --
-----------------------------------------------------------------------------
SELECT productPrice, productsLeft, specification
FROM stock_info
WHERE stockID = 3
AND productsLeft > 10;
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-- Получить список, содержащий спецификацию и отпускную стоимость всех --
-- товаров на складе по коду каталога 5 и отсортированный в обратном --
-- порядке по отпускной стоимости. --
-----------------------------------------------------------------------------
SELECT productPrice, specification
FROM stock_info
WHERE stockID = 5
ORDER BY productPrice DESC;
-----------------------------------------------------------------------------
